ERP.belugaerp/src/Catalogs/битТипыПриемкиWMS/битТипыПриемкиWMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битТипыПриемкиWMS</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПроверятьПаллеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроверяемыхКоробокВПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроверяемыхБутылокВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/битТипыПриемкиWMS/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПроверятьПаллетыПриИзменении(Элемент)
	
	Если Не Объект.ПроверятьПаллеты Тогда
		Объект.КоличествоПроверяемыхКоробокВПаллете = 0;	
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКоробкиПриИзменении(Элемент)
	
	Если Не Объект.ПроверятьКоробки Тогда
		Объект.КоличествоПроверяемыхБутылокВКоробке = 0;	
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	
	Форма.Элементы.ГруппаПараметрыПриемки.Доступность = Не ЭтоПредопределенныйТипПриемки(Форма.Объект.Ссылка);
	
	Форма.Элементы.КоличествоПроверяемыхКоробокВПаллете.Доступность = Форма.Объект.ПроверятьПаллеты;
	Форма.Элементы.КоличествоПроверяемыхБутылокВКоробке.Доступность = Форма.Объект.ПроверятьКоробки;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПредопределенныйТипПриемки(Ссылка)

	Возврат Ссылка = Справочники.битТипыПриемкиWMS.БезПроверки
		Или Ссылка = Справочники.битТипыПриемкиWMS.Полная;

КонецФункции

#КонецОбласти
